Revit 2026 API

# MEPNetworkSegmentIdElementId Property

---

The element id where this analytical segment belongs.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId ElementId { get; set; }
```
```vb
Public Property ElementId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ ElementId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member ElementId : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

MEPNetworkSegmentId Class

Autodesk.Revit.DB.Analysis Namespace